## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.minha_chave_kms will be created
  + resource "aws_kms_key" "minha_chave_kms" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 20
      + description                        = "An example symmetric encryption KMS key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-default-1"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::072359095972:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReplicateKey",
                          + "kms:Create*",
                          + "kms:Describe*",
                          + "kms:Enable*",
                          + "kms:List*",
                          + "kms:Put*",
                          + "kms:Update*",
                          + "kms:Revoke*",
                          + "kms:Disable*",
                          + "kms:Get*",
                          + "kms:Delete*",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:CancelKeyDeletion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::072359095972:user/Alice"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow administration of the key"
                    },
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey",
                          + "kms:GenerateDataKeyWithoutPlaintext",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::072359095972:user/Bob"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow use of the key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "minha-chave-kms"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "minha-chave-kms"
        }
    }

  # aws_sqs_queue.minha_fila_sqs will be created
  + resource "aws_sqs_queue" "minha_fila_sqs" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "minha-fila-sqs"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Environment" = "dev"
        }
      + tags_all                          = {
          + "Environment" = "dev"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>